[ { "title": "How well defined is the end goal?"
  , "description": "Some programmers have a very clear idea of what the finished piece of software should look like and what it should do. Others take a more exploratory approach. The following statements are about how clearly defined the end-goal of a project is before you start programming."
  , "statements":
    [ { "statement": "Before starting to program I have a clear idea what the program will look like." }
    , { "statement": "Before starting to program I have a clear idea how the program will work." }
    , { "statement": "Before starting to program I have a clear idea how to organise my code." }
    , { "statement": "Before starting to program I write down what I need to do." }
    , { "statement": "Before starting to program I sketch or wireframe how the program will look." }
    ]
  , "ratings":
    [ "Strongly Disagree"
    , "Disagree"
    , "Neutral"
    , "Agree"
    , "Strongly Agree"
    ]
  }
, { "title": "How much time do you spend on, and how big is, the finished project?"
  , "description": "Some programmers work on projects for many months or even years. Others prefer to work on a project for just a matter of days or hours. The following statements are about how long a typical project takes before you consider it complete, and how large the codebase is when it is finished."
  , "statements":
    [ { "statement": "A typical project takes a significant amount of time to complete." }
    , { "statement": "A finished project’s codebase tends to span multiple files with many lines of code." }
    , { "statement": "I tend to considered a project finished after one programming session." }
    , { "statement": "A finished project’s codebase tends to be made up of one or two files." }
    ]
  , "ratings":
    [ "Strongly Disagree"
    , "Disagree"
    , "Neutral"
    , "Agree"
    , "Strongly Agree"
    ]
  }
, { "title": "How much did the project change from beginning to end?"
  , "description": ""
  , "statements":
    [ { "statement": "A project is only finished when all my tests pass." }
    , { "statement": "Non-critical bugs can lead to unexpected behaviour that makes the project betteror more interesting." }
    , { "statement": "The primary method of interaction has often changed by the time a project is finished." }
    , { "statement": "The primary audio output has often changed by the time a project is finished." }
    ]
  , "ratings":
    [ "Strongly Disagree"
    , "Disagree"
    , "Neutral"
    , "Agree"
    , "Strongly Agree"
    ]
  }
]